{"newspapers": {"cnn": {"link": "http://edition.cnn.com/", "articles": [{"title": "How to Watch VR", "text": "IN YOUR HEADSET...\n\nHeadsets are hands-down the best way to watch VR stories. You can see the latest from CNNVR on the Samsung VR app , the Oculus Video app on Rift , or on the CNNVR app on Google Daydream . Just look left or right to explore the 360 world around you. Believe us, you need to try this.", "link": "http://edition.cnn.com/2017/03/04/vr/how-to-watch-vr", "published": "2017-03-04T00:00:00"}, {"title": "Can Mongolian herders change high fashion?", "text": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.", "link": "http://edition.cnn.com/videos/world/2018/02/09/yak-tengri-nancy-great-by-design-jlm-orig-lon.cnn/video/playlists/intl-great-by-design/", "published": "2018-02-09T00:00:00"}, {"title": "How British spies made a cyber immune system", "text": "This cybersecurity network uses artificial intelligence to not just fix computer viruses, but to stop them before they start\n\nSource: CNN", "link": "http://edition.cnn.com/videos/world/2018/01/26/cybersecurity-great-by-design-orig-lon.cnn/video/playlists/intl-great-by-design/", "published": "2018-01-26T00:00:00"}, {"title": "The mural taller than the Statue of Liberty", "text": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.", "link": "http://edition.cnn.com/videos/world/2018/01/18/nomad-clan-great-by-design-orig-lon.cnn/video/playlists/intl-great-by-design/", "published": "2018-01-18T00:00:00"}]}, "bbc": {"rss": "http://feeds.bbci.co.uk/news/rss.xml", "link": "http://www.bbc.com/", "articles": [{"link": "http://www.bbc.co.uk/news/world-asia-43846488", "published": "2018-04-20T23:26:27", "title": "North Korea 'halts missile and nuclear tests', says Kim Jong-un", "text": "Image copyright Getty Images Image caption Kim Jong-Un says there is no need for further missile tests\n\nNorth Korean leader Kim Jong-un has said he will suspend all missile tests and shut down a nuclear test site with immediate effect.\n\n\"From April 21, North Korea will stop nuclear tests and launches of intercontinental ballistic missiles,\" the Korean Central News Agency said.\n\nThe decision is aimed at pursuing economic growth and peace on the Korean peninsular, state media report.\n\nMr Kim is due to meet his South Korean counterpart Moon Jae-in next week.\n\nHe is also expected to hold an unprecedented summit with US President Donald Trump by June. If it takes place, it will be the first meeting between a sitting US president and a North Korean leader.\n\n\"This is very good news for North Korea and the World - big progress!,\" Mr Trump tweeted after Kim Jong-un's announcement.\n\nSkip Twitter post by @realDonaldTrump North Korea has agreed to suspend all Nuclear Tests and close up a major test site. This is very good news for North Korea and the World - big progress! Look forward to our Summit. — Donald J. Trump (@realDonaldTrump) April 20, 2018 Report\n\nOn Thursday, the US leader said there was a \"bright path available to North Korea when it achieves denuclearisation\".\n\nAlso on Thursday, Mr Moon said North Korea had said it was ready for \"complete denuclearisation\". He called for \"bold imagination and creative solutions\" to ensure the Koreas summit and the Trump-Kim summit would succeed.\n\nNorth Korea has repeatedly defied international sanctions over its weapons programme.\n\nIn November, it said it had successfully tested a new type of intercontinental ballistic missile that could reach the whole of the continental United States.\n\nThe test drew swift international condemnation. UN Secretary General Antonio Guterres said Pyongyang had shown \"complete disregard for the united view of the international community\".\n\nThe latest announcement from Pyongyang comes during a thawing of relations between North and South Korea.\n\nA telephone hotline has been set up between Mr Kim and Mr Moon ahead of the first inter-Korean summit in over a decade.\n\n\"It was as if we were talking to a neighbour right next door,\" a South Korean official told local media after a successful test call that lasted 4 minutes 17 seconds.\n\nThe agreement to set up the phone link was made last month when Mr Moon's top security adviser travelled to Pyongyang for a meeting with Mr Kim, who then agreed to hold the inter-Korean summit.\n\nThe two states remain technically at war since the 1950-53 Korean War ended in an armistice, with neither side able to claim an outright victory."}, {"link": "http://www.bbc.co.uk/news/world-europe-43841194", "published": "2018-04-20T21:09:47", "title": "Avicii, top electronic dance music artist, found dead at 28", "text": "Image copyright Reuters Image caption DJ Avicii - real name Tim Bergling - died on Friday, his representative announced\n\nSwedish DJ Avicii, one of the world's biggest dance music stars, has died in Oman at the age of 28.\n\nAvicii's club anthems include Wake Me Up, Levels, and recently, Lonely Together with Rita Ora.\n\nHis representative said in a statement: \"It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii.\n\n\"The family is devastated and we ask everyone to please respect their need for privacy in this difficult time.\"\n\nNo cause of death was announced, and Avicii's representative said no further statements would be issued.\n\nThe electronic dance music (EDM) star, who reportedly made $250,000 (£180,000) a night on tour, had struggled with some health issues in the past, having his gall bladder and appendix removed in 2014.\n\nHe announced his retirement from touring in 2016, partly because of the health problems.\n\n\"I know I am blessed to be able to travel all around the world and perform, but I have too little left for the life of a real person behind the artist,\" he said at the time.\n\nWho was Avicii?\n\nOne of the biggest names in dance music of the last 10 years, he had a catalogue full of pumping, uplifting, house smashes\n\nHe started his career when he won a production competition held by Pete Tong in 2008\n\nHe went on to notch up 11 billion streams on Spotify and was the first EDM DJ to stage a worldwide arena tour\n\nHe was nominated for two Grammy Awards and had nine UK top 10 singles, including two number ones\n\nHe suffered from health problems including acute pancreatitis, in part due to excessive drinking\n\nHe later announced a return to the studio, and released a new self-titled EP in 2017.\n\nThe EP, Avĩci (01), was nominated for a Billboard music award for top electronic album just days before his death.\n\nMedia playback is unsupported on your device Media caption The DJ will be remembered for club hits like Levels, Wake Me Up and Hey Brother\n\nAs well as working with the likes of Aloe Blacc and Rita Ora, Avicii collaborated with artists including Madonna and Coldplay.\n\nFormer Radio 1 DJ Judge Jules, who often performed alongside him, said his biggest achievement was being the first electronic dance star to break America.\n\n\"He was the first huge commercial star,\" Judge Jules told the BBC. \"He really became someone who couldn't go out on the street, he was so heavily recognised.\"\n\nOther leading electronic artists wrote tributes to Bergling after the news of his death.\n\nSkip Twitter post by @CalvinHarris Devastating news about Avicii, a beautiful soul, passionate and extremely talented with so much more to do. My heart goes out to his family. God bless you Tim x — Calvin Harris (@CalvinHarris) April 20, 2018 Report\n\nSkip Twitter post by @deadmau5 my sincerest and most heartfelt condolences to the friends, fans and families of @Avicii :( Banter aside, nobody can deny what he has accomplished and done for modern dance music and im very proud of him. — Goat lord (@deadmau5) April 20, 2018 Report\n\nSinger Dua Lipa tweeted: \"Such sad news to hear about Avicii passing. Too young and way too soon. My condolences go out to his family, friends and fans.\"\n\nUS band Imagine Dragons tweeted: \"Working with him was one of my favourite collaborative moments. Far too young. The world was a happier and fuller place with his presence and art.\"\n\n\"No words can describe the sadness I'm feeling right now, hearing about Avicii passing away,\" offered DJ Zedd, while singer Adam Lambert, who collaborated on the track Lay Me Down, called him \"a brilliant composer and a gentle spirit.\"\n\nAn enchanting artist\n\nAnalysis by Mark Savage, BBC Music reporter\n\nAt Avicii's last ever show in August 2016, one crazed fan climbed a 100ft-high (30m) scaffolding tower, just to get a better view.\n\nThat's not something that happens that often during a DJ set (who needs to see the stage anyway?) but it was a testament to Avicii's ability to enchant an audience.\n\nConfetti cannons and bass drops aside, his shows encapsulated the inclusive, everyone-welcome philosophy that led him to collaborate with Coldplay, Nile Rodgers and Antony Hegarty as well as bluegrass and metal musicians in the studio.\n\nThat final show, at Ushuaia Ibiza, was a two-hour greatest hits set, featuring crowd pleasers like Levels and Wake Me Up alongside his remixes of Robyn and Dizzee Rascal.\n\nBut the DJ, who famously let the cat out of the bag when he revealed most major DJs pre-programmed their sets (comments he later walked back), was also known for dropping unexpected, whimsical tracks into his performances. A bit of Smokey Robinson here; a dash of Chicago there.\n\nHe approached it all with an energy and optimism that permeated his own recordings. It's no surprise he was one of the most beloved DJs on the circuit.\n\nAvicii in his own words\n\nTo Billboard Magazine in 2016: \"When I look back on my life, I think: whoa, did I do that? It was the best time of my life in a sense. It came with a price - a lot of stress, a lot of anxiety for me - but it was the best journey of my life\"\n\nPost-retirement on his website: \"[Creating music], that is what I live for, what I feel I was born to do... The next stage will be all about my love of making music to you guys. It is the beginning of something new.\"\n\nPrelude to music video for hit The Nights: \"When I was 16, my father said, 'You can do anything you want with your life, you just have to be willing to work hard to get it.' That's when I decided when I die, I want to be remembered for the life I live, not the money I make.\"\n\n\n\nAre you an Avicii fan? Did you meet him or go to one of his gigs? Tell us about it by emailing haveyoursay@bbc.co.uk.\n\nYou can also contact us in the following ways:"}, {"link": "http://www.bbc.co.uk/news/entertainment-arts-43843615", "published": "2018-04-20T21:23:03", "title": "Avicii, top electronic dance music artist, found dead at 28", "text": "Video\n\nSwedish DJ Avicii, one of the world's biggest dance music stars, has died in Oman at the age of 28.\n\nAvicii's club anthems include Wake Me Up, Hey Brother, and recently, Lonely Together with Rita Ora.\n\nHis representative said in a statement: \"It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii.\n\n\"The family is devastated and we ask everyone to please respect their need for privacy in this difficult time.\"\n\nNo cause of death was announced, and Avicii's representative said no further statements would be issued."}, {"link": "http://www.bbc.co.uk/news/uk-43846047", "published": "2018-04-20T23:09:09", "title": "Theresa May: Compensation for Windrush generation", "text": "Image copyright Getty Images Image caption Theresa May apologised to Caribbean leaders earlier in the week\n\nTheresa May has confirmed that members of the Windrush generation who have been treated unfairly by the Home Office will be compensated.\n\nThe BBC understands the compensation will be for financial losses incurred.\n\nMore details on the plans are expected to be published within the next week.\n\nThe government has apologised after some children of Caribbean migrants who settled in the UK before the 1970s had been declared illegal immigrants and threatened with deportation.\n\nOn Thursday, Chief Secretary to the Treasury, Liz Truss, told BBC Question Time that the government would \"look sympathetically\" at compensation requests from Windrush immigrants.\n\nMrs May's first public mention of remuneration came at a news conference concluding the Commonwealth Heads of Government Meeting (Chogm) in London on Friday.\n\nShe said: \"On Tuesday, I met with Caribbean leaders, where I gave an absolute commitment that the UK government will do whatever it takes - including where appropriate payment of compensation - to resolve the anxieties and problems which some of the Windrush generation have suffered.\n\n\"These people are British, they are part of us, they helped to build Britain and we are all the stronger for their contributions.\"\n\nMedia playback is unsupported on your device Media caption Windrush migrant Nick Broderick: 'I contemplated suicide'\n\nLabour MP David Lammy, who has spearheaded the campaign for the Windrush generation, said more detail was needed from the government.\n\nHe said that \"compensation and reparations\" should be provided \"to anyone who had lost their job, their pension, access to healthcare, or been detained or deported\".\n\nGrenada's Prime Minister Keith Mitchell has also called for \"serious\" compensation in light of the PM's speech, saying it was \"highly significant\" she had mentioned compensation.\n\nHe said: \"It's not just, 'I'm sorry.' People lost a lot, people suffered a lot of pain, and they must be given an opportunity to correct this - some serious compensation.\n\n\"If not the person, if they've gone, then the families who have suffered too.\"\n\nA total of 286 people have contacted the Home Office since Monday, when the department set up a helpline to support those who had concerns about their migration status.\n\nSo far, eight have been given permanent residence status."}]}, "theguardian": {"rss": "https://www.theguardian.com/uk/rss", "link": "https://www.theguardian.com/international", "articles": [{"link": "https://www.theguardian.com/world/2018/apr/20/north-korea-suspends-nuclear-missile-tests", "published": "2018-04-20T22:34:18", "title": "North Korea halts nuclear and missile tests ahead of planned Trump summit", "text": "North Korea has said it will end its tests of nuclear weapons and intercontinental ballistic missiles, and shut down its nuclear test site, in a dramatic development ahead of a much-anticipated meeting between its leader, Kim Jong-un, and Donald Trump.\n\nThe suspensions went into immediate effect on Saturday, according to state-run KCNA news agency.\n\nThe US president greeted the news in a tweet. “This is very good news for North Korea and the World – big progress!” Trump wrote.\n\nDonald J. Trump (@realDonaldTrump) North Korea has agreed to suspend all Nuclear Tests and close up a major test site. This is very good news for North Korea and the World - big progress! Look forward to our Summit.\n\nThe news comes less than a week before Kim meets the South Korean president, Moon Jae-in, for a summit in the demilitarized zone that divides the peninsula.\n\nIt goes a long way towards meeting US demands for denuclearisation, as Pyongyang and Washington work to agree on when and where Kim will meet Trump for historic talks that barely seemed possible just a few months ago.\n\nThe decision to suspend nuclear tests and missile launches came at a plenary meeting of the ruling party’s central committee, which had convened on Friday to discuss a “new stage” of policies – prompting speculation that the regime would move towards denuclearisation.\n\n\n\n“As the weaponisation of nuclear weapons has been verified, it is not necessary for us to conduct any more nuclear tests or test launches of mid- and long-range missiles or ICBMs,” Kim told the meeting.\n\n\n\n“The northern nuclear test site has completed its mission,” he added at the meeting, according to KCNA.\n\nNorth Korea has conducted all six of its nuclear tests at the same Punggye-ri test site in the country’s north-east. It tested its first nuclear weapon in 2006, while its last – and most powerful – test came last September.\n\nNorth Koreans in the dark about Trump summit – but officials know 'he's crazy' Read more\n\nThose tests, plus a string of missile launches ordered by Kim over the past year, at one point appeared to be taking the peninsula to the brink of conflict.\n\nThe North’s quest to develop a deterrent against what it has long described as US hostility resulted in an extraordinary exchange of insults between Kim and Trump, and frequent warnings from Washington that it would not rule out military action to end Kim’s nuclear ambitions.\n\nSaturday’s announcement came the day after a hotline between Kim and the South Korean president went live.\n\n\n\nThe hotline connects Moon’s desk at the presidential Blue House with North Korea’s state affairs commission, which is headed by Kim, Yonhap news agency said.\n\nEarlier this week Moon, a liberal whose election in May raised hopes of a detente on the Korean peninsula, said that Pyongyang had expressed a desire for the “complete denuclearisation” of the Korean peninsula without attaching preconditions such as the withdrawal of US troops.\n\n\n\nThe two countries are due to hold a summit next Friday on the southern side of the demilitarised zone.\n\nThe meeting is to be followed in May or June by a meeting between Kim and Trump. The US president on Wednesday pledged to meet Kim “in the coming weeks” but said he was prepared to walk away if the talks were not fruitful."}, {"link": "https://www.theguardian.com/uk-news/2018/apr/20/theresa-may-says-windrush-victims-will-be-paid-compensation", "published": "2018-04-20T17:45:39", "title": "Theresa May says Windrush victims will be paid compensation", "text": "Theresa May has reassured Commonwealth leaders that members of the Windrush generation who had suffered “anxieties and problems” as a result of the government’s immigration rules would be paid compensation.\n\n\n\n'It's inhumane': the Windrush victims who have lost jobs, homes and loved ones Read more\n\nThe prime minister said she had given Caribbean leaders an “absolute commitment” at a meeting earlier this week that “the UK will do whatever it takes including, where appropriate, payment of compensation, to resolve the anxieties and problems that some of the Windrush generation have suffered”.\n\nShe added: “These people are British. They are part of us; they helped to build Britain and we are all the stronger for their contributions.”\n\nMay was speaking at the closing press conference for the Commonwealth heads of government meeting in London, which has been overshadowed by the treatment of the Windrush generation.\n\nPlay Video 2:15 Theresa May apologises for treatment of Windrush generation – video\n\nShe has been under intense pressure to provide more reassurance – and pay compensation – to the affected individuals, some of whom have lost homes and jobs and been threatened with deportation.\n\nQ&A What is the Windrush deportation crisis? Show Hide Who are the Windrush generation? They are people who arrived in the UK after the second world war from Caribbean countries at the invitation of the British government. The first group arrived on the ship MV Empire Windrush in June 1948. What is happening to them? An estimated 50,000 people face the risk of deportation if they never formalised their residency status and do not have the required documentation to prove it. Why is this happening now? It stems from a policy, set out by Theresa May when she was home secretary, to make the UK 'a really hostile environment for illegal immigrants'. It requires employers, NHS staff, private landlords and other bodies to demand evidence of people’s citizenship or immigration status. Why do they not have the correct paperwork and status? Some children, often travelling on their parents’ passports, were never formally naturalised and many moved to the UK before the countries in which they were born became independent, so they assumed they were British. In some cases, they did not apply for passports. The Home Office did not keep a record of people entering the country and granted leave to remain, which was conferred on anyone living continuously in the country since before 1 January 1973. What is the government doing to resolve the problem? On Monday, the home secretary Amber Rudd announced the creation of a new Home Office team dedicated to ensuring that Commonwealth-born long-term UK residents would no longer find themselves classified as being in the UK illegally. Photograph: Douglas Miller/Hulton Archive\n\nThe Labour MP David Lammy and the Jamaican prime minister, Andrew Holness, are among those to have called for compensation.\n\nSpeaking to reporters after the press conference, the prime minister of Grenada, Keith Mitchell, said he believed May and the UK government should be doing more to address the situation.\n\nAmber Rudd boasted of harsher immigration strategy, leak reveals Read more\n\n“I think there’s no question,” he said. “Clearly it’s something which is vibrating strongly in the Caribbean region as a whole. Many of our people came here and helped to build Britain, under conditions that were set for them. For me, it’s very unfair for them to be treated in the way they have been treated.\n\n“The word compensation came out today - that was highly significant, extremely important. It’s not just, ‘I’m sorry.’ People lost a lot, people suffered a lot of pain, and they must be given an opportunity to correct this – some serious compensation. If not the person, if they’ve gone, then the families who have suffered, too.”\n\nAsked if May should accept her “hostile environment” immigration policy was a mistake, Mitchell praised the prime minister for pledging to address the crisis.\n\n'I thought I would die': Windrush man left homeless after brain surgery Read more\n\nHe said: “I think the fact she has addressed it is indicating that Britain and the policy they enunciated initially was not the right one. And therefore by making the statement she made today, I think she’s heading in the right direction. And I’ll give her credit for making the right turn.”\n\nReacting to May’s announcement, Sarah O’Connor, 57, who moved to Britain from Jamaica 51 years ago when she was six, and faced bankruptcy after she was unable to take up a new job last year because she had no papers, said she was interested to hear about compensation but mainly felt rage with the government at the emerging scandal.\n\n“It makes me feel so angry that you have to go through all the anxiety, depression and feeling scared for it all to come to the surface,” she said. |People must have known in the Home Office that Windrush children were suffering and they pushed in under the table. I’m appalled.”\n\nShe said she had had no idea that other people were suffering in the same way that she was. “It’s good more people are standing up and saying this is what is happening to me. Before they were too scared to anything, now they are standing up for their rights.”\n\nJudy Griffith, 63, who flew from Barbados in 1963 when she was nine, said she was sceptical of the government’s commitment to resolving this. “I am concerned it will end up like the Grenfell fire. The government is making promises which then get forgotten once the interest dies down, and the whole thing gets swept under the carpet.”\n\n\n\nThe promise of compensation came as it was revealed that the number of people who had contacted the Home Office’s helpline set up to offer support for members of the Windrush generation had risen to 232. The first four people whose cases have gone to a dedicated team of officials have been given permanent residence status.\n\n\n\nFacebook Twitter Pinterest Diane Abbott attends the protest in Windrush Square, Brixton Photograph: Chris J Ratcliffe/Getty Images\n\nLater, the shadow home secretary, Diane Abbott, addressed a Windrush rally in Brixton, south London, telling them that the home secretary, Amber Rudd, and May, should not be apologising over the scandal. “You know why? Because you only apologise when you make a mistake,” she said. “They knew what they were doing.”\n\nThe government “knew the consequences of that hostile climate would affect black people, whether or not they had immigration issues”, Abbott said, adding that ministers “thought they could get away with it; they thought nobody would care”. She demanded to know how many people were being held in detention centres and how many had been removed from the country.\n\nShe said those in detention must be released and those who had been removed must be invited to come back – and be compensated by the government. “Think what it means: you are separated from your families and your friends, you are separated often from your healthcare treatment. You are humiliated. And they did not care that they were humiliating people who helped to rebuild this country after the second world war.”"}, {"link": "https://www.theguardian.com/music/2018/apr/20/swedish-dj-avicii-dies-aged-28", "published": "2018-04-20T19:04:29", "title": "Avicii: chart-topping EDM star dies aged 28", "text": "Swedish DJ Avicii has died in Muscat, Oman, at the age of 28.\n\nHis representative said in a statement: “It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii. He was found dead in Muscat, Oman, this Friday afternoon local time, 20 April.\n\n“The family is devastated and we ask everyone to please respect their need for privacy in this difficult time. No further statements will be given.”\n\n\n\nDJ Calvin Harris tweeted: “Devastating news about Avicii, a beautiful soul, passionate and extremely talented with so much more to do. My heart goes out to his family. God bless you Tim x.”\n\nIn an Instagram post, Diplo called him “a real groundbreaker and influencer to all your peers” while Deadmau5 tweeted: “nobody can deny what he has accomplished and done for modern dance music and im very proud of him.”\n\nIn 2016, Avicii retired from live performing due to health reasons, having suffered from acute pancreatitis owing, in part, to excessive drinking. In 2014, his gallbladder and appendix had been removed.\n\nFacebook Twitter Pinterest Avicii performs at the Summerburst music festival at Ullevi stadium in Gothenburg, Sweden. Photograph: Bjorn Larsson Rosvall/AFP/Getty Images\n\nA documentary about the DJ’s career, Avicii: True Stories, was released last autumn, chronicling his final world tour and his health struggles. It features peers such as the DJs Tiesto and David Guetta, as well as musicians Chris Martin and Nile Rodgers. “Everybody knows Avicii but very few people know Tim,” said director Levan Tsikurishvili. “I think this documentary really shows Tim’s struggle and strength of character.”\n\nAvicii last released new music in 2017, with his six-track EP Avīci (01). The album was nominated for a Billboard music award in the category of top dance/electronic album. In his most recent tweet, sent out on 17 April, Avicii thanked Billboard for the nomination.\n\nHe was best known for hit songs Wake Me Up and Levels, both of which reached No 1 on the Billboard list of top dance club songs. Twice-nominated for a Grammy award for best dance recording, Avicii’s debut album True, released in 2013, madethe top 10 in 10 different countries.\n\nThe DJ, who was born in Stockholm, was regularly ranked in the top five of Forbes’ list of highest-paid DJs before his retirement. In 2012, he became the first electronic musician to headline New York’s esteemed Radio City Music Hall.\n\n\n\nIn a 2017 interview with Rolling Stone, Avicii reflected on his decision to stop touring, explaining how multiple hospitalizations and life on the road began to take their toll. “None of us today can fucking handle our emotions – most of us are running around being reactive,” he said.\n\n“That’s why I had to stop touring, because I couldn’t read my emotions the right way. The whole thing was about success for the sake of success. I wasn’t getting any happiness anymore.”"}, {"link": "https://www.theguardian.com/uk-news/2018/apr/20/man-arrested-over-suspected-role-in-hither-green-burglary", "published": "2018-04-20T21:14:44", "title": "Man arrested over suspected role in Hither Green burglary", "text": "Billy Jeeves arrested two weeks after burglary in which intruder was stabbed to death\n\nA man suspected of being an accomplice in a burglary in which one of the intruders was stabbed to death earlier this month has been arrested, police have said.\n\nBilly Jeeves, 28, who had been on the run since the incident on Wednesday 4 April, was tracked to northern Kent and arrested on suspicion of two counts of burglary, theft and possession of a controlled substance at about 5.30pm on Friday.\n\nHenry Vincent, 37, was killed during the incident in Hither Green, southeast London, after a struggle broke out between him and the 78-year-old homeowner, Richard Osborn-Brooks. The latter was arrested over the death, but released and told he would face no further action shortly afterwards.\n\nFollowing the incident, police appealed for information about an alleged accomplice and said he may have escaped in a white van. The vehicle was found burned out on the evening of Saturday 7 April in Orpington.\n\n\n\nJeeves was detained by officers from the Metropolitan police’s homicide and major crime command, with support from officers from the territorial support group and Kent police officers. He was taken into custody at a Kent station.\n\nScotland Yard said it was not looking for anyone else in connection with this investigation, though they stressed that inquiries would continue.\n\nThe incident was the subject of national attention and tempers were frayed when friends and family of Vincent sought to mark the site of his death with flowers and other tributes.\n\nSome people repeatedly tore down the monuments, only for them to be replaced soon afterwards. The tensions led police to step in to appeal for calm.\n\n“I do not want anyone to feel intimidated or that they are not being allowed to respond in a dignified way to a tragic death,” said Ch Supt Simon Dobinson.\n\n\n\n“We would urge members of the public to respect the wishes of those who choose to place flowers and other tributes in the area. We would also request those placing tributes or visiting the area to behave in a responsible manner so as not to disrupt the local community.”"}]}, "breitbart": {"link": "http://www.breitbart.com/", "articles": [{"title": "Reports: North Korean State Media Announced Nuclear Program Shutdown", "text": "Various reports in American and South Korean state media Friday evening indicated that North Korean dictator Kim Jong-un announced the halt of nuclear and missile tests in his country. The reports did not specify whether the tests would conclude permanently.\n\nThe South Korean newswire service Yonhap reports that the Korean Central News Agency (KCNA) published the announcement from Kim, which read, “from April 21, North Korea will stop nuclear tests and launches of intercontinental ballistic missiles.”\n\n“The North will shut down a nuclear test site in the country’s northern side to prove the vow to suspend nuclear test,” the announcement concluded.\n\nNK News, a website focusing on updates from the communist country, reported that Kim told a Workers’ Party of Korea (WPK) meeting that there was “no need” for such a nuclear program anymore.\n\nReuters also confirmed the KCNA report. Sputnik, a Russian state site, added the detail North Korea will “join international efforts to halt nuclear tests altogether,” according to Kim.\n\nAt press time, the report does not appear on the aggregator of North Korean media content KCNA Watch (KCNA’s website has long ceased to be available in the United States).\n\nThe announcement follows the debut of a historic direct hotline between Kim and South Korean President Moon Jae-in, who will meet Kim next Friday in the border town of Panmunjom, Kim’s first visit to South Korea. The two nations agreed to a live broadcast of the summit, which reports have indicated would focus on the possibility of ending the Korean War – technically still ongoing, despite being at a stalemate – and the “denuclearization of the Korean peninsula,” a phrase that some have speculated North Korea will interpret to mean a diminished U.S. presence on the site. Kim reportedly told South Korean officials in a March meeting that denuclearization was father Kim Jong-il’s “dying wish.”\n\nNorth Korea remains the world’s most prolific human rights abuser, strictly punishing citizens – with death or extended labor camp sentences for attempting to access Western media. Christian North Koreans, or those caught within the vicinity of Bibles, are routinely imprisoned and tortured. North Koreans are forced into a strict caste system known as songbun, in which multiple generations of families can be punished with poverty should any one member be suspected of opposing the Kim regime.\n\nPresident Donald Trump is preparing to meet Kim in person at a summit in May or early June, according to the White House. No meeting between a U.S. leader and a Kim dynasty dictator has occurred since Kim Il-Sung founded the communist state in 1948.", "link": "http://www.breitbart.com/national-security/2018/04/20/north-korean-state-media-claims-shutdown-nuclear-program/", "published": "2018-04-20T00:00:00"}, {"title": "Reports: North Korean State Media Announced Nuclear Program Shutdown", "text": "Various reports in American and South Korean state media Friday evening indicated that North Korean dictator Kim Jong-un announced the halt of nuclear and missile tests in his country. The reports did not specify whether the tests would conclude permanently.\n\nThe South Korean newswire service Yonhap reports that the Korean Central News Agency (KCNA) published the announcement from Kim, which read, “from April 21, North Korea will stop nuclear tests and launches of intercontinental ballistic missiles.”\n\n“The North will shut down a nuclear test site in the country’s northern side to prove the vow to suspend nuclear test,” the announcement concluded.\n\nNK News, a website focusing on updates from the communist country, reported that Kim told a Workers’ Party of Korea (WPK) meeting that there was “no need” for such a nuclear program anymore.\n\nReuters also confirmed the KCNA report. Sputnik, a Russian state site, added the detail North Korea will “join international efforts to halt nuclear tests altogether,” according to Kim.\n\nAt press time, the report does not appear on the aggregator of North Korean media content KCNA Watch (KCNA’s website has long ceased to be available in the United States).\n\nThe announcement follows the debut of a historic direct hotline between Kim and South Korean President Moon Jae-in, who will meet Kim next Friday in the border town of Panmunjom, Kim’s first visit to South Korea. The two nations agreed to a live broadcast of the summit, which reports have indicated would focus on the possibility of ending the Korean War – technically still ongoing, despite being at a stalemate – and the “denuclearization of the Korean peninsula,” a phrase that some have speculated North Korea will interpret to mean a diminished U.S. presence on the site. Kim reportedly told South Korean officials in a March meeting that denuclearization was father Kim Jong-il’s “dying wish.”\n\nNorth Korea remains the world’s most prolific human rights abuser, strictly punishing citizens – with death or extended labor camp sentences for attempting to access Western media. Christian North Koreans, or those caught within the vicinity of Bibles, are routinely imprisoned and tortured. North Koreans are forced into a strict caste system known as songbun, in which multiple generations of families can be punished with poverty should any one member be suspected of opposing the Kim regime.\n\nPresident Donald Trump is preparing to meet Kim in person at a summit in May or early June, according to the White House. No meeting between a U.S. leader and a Kim dynasty dictator has occurred since Kim Il-Sung founded the communist state in 1948.", "link": "http://www.breitbart.com/national-security/2018/04/20/north-korean-state-media-claims-shutdown-nuclear-program/#disqus_thread", "published": "2018-04-20T00:00:00"}, {"title": "Ann Coulter: ‘Not Sure I Trust James Comey as a Reliable Narrator’ — ‘A Gigantic, Pompous Fruitcake’", "text": "On Sirius XM’s “News & Issues,” conservative commentator Ann Coulter said former FBI Director James Comey came across as a “gigantic, pompous fruitcake.”\n\nWhen asked about the Comey memos, Coulter said, “I’m not sure I trust James Comey as a reliable narrator. Mostly based on him just being a gigantic, pompous fruitcake. And every interaction I think he has, from the time he was in kindergarten, was him bravely speaking truth to power.”\n\nShe added Comey’s book “A Higher Loyalty” was, “utter pompous, self-aggrandizing. H\n\n“He’s standing up to power, everyone else is dirty and compromised, but he alone will speak the truth because he’ll tell his grandchildren what his north star was,” she added.\n\nFollow Pam Key on Twitter @pamkeyNEN", "link": "http://www.breitbart.com/video/2018/04/20/ann-coulter-not-sure-trust-james-comey-reliable-narrator-gigantic-pompous-fruitcake/", "published": "2018-04-20T00:00:00"}, {"title": "Ann Coulter: ‘Not Sure I Trust James Comey as a Reliable Narrator’ — ‘A Gigantic, Pompous Fruitcake’", "text": "On Sirius XM’s “News & Issues,” conservative commentator Ann Coulter said former FBI Director James Comey came across as a “gigantic, pompous fruitcake.”\n\nWhen asked about the Comey memos, Coulter said, “I’m not sure I trust James Comey as a reliable narrator. Mostly based on him just being a gigantic, pompous fruitcake. And every interaction I think he has, from the time he was in kindergarten, was him bravely speaking truth to power.”\n\nShe added Comey’s book “A Higher Loyalty” was, “utter pompous, self-aggrandizing. H\n\n“He’s standing up to power, everyone else is dirty and compromised, but he alone will speak the truth because he’ll tell his grandchildren what his north star was,” she added.\n\nFollow Pam Key on Twitter @pamkeyNEN", "link": "http://www.breitbart.com/video/2018/04/20/ann-coulter-not-sure-trust-james-comey-reliable-narrator-gigantic-pompous-fruitcake/#disqus_thread", "published": "2018-04-20T00:00:00"}]}, "infowars": {"link": "https://www.infowars.com/", "articles": [{"title": "Trump Announces Plan To Build An Arab Army So US Troops Can Leave Syria", "text": "Alex Jones breaks down how President Trump plans to build an Arab Army in the middle east, trained by U.S. soldiers, that can then handle the region and provide stability as the country is returned.", "link": "https://www.infowars.com/trump-announces-plan-to-build-an-arab-army-so-us-troops-can-leave-syria/", "published": "2018-04-17T13:47:15-05:00"}, {"title": "Macron: Europe Faces ‘Unprecedented’ Mass Migration, ‘Shares Destiny’ With Africa", "text": "‘Bombshell’ population growth in Africa means Europe is entering an “unprecedented” age of mass migration, Emmanuel Macron has said, asserting that the two continents’ destinies are “bound.”\n\n“The migratory phenomenon we are facing will be historic,” declared the French president in a television appearance Sunday night, when he announced that “great poverty”, “climate change”, and “geopolitical conflicts” will see Africans flooding into Europe “for many years to come”.\n\nTo back up his point, Macron pointed to “bombshell” population gr0wth across the third world continent, which he added has been “tremendously well described” by French-American journalist and professor Stephen Smith in a recent book.\n\nRead more", "link": "https://www.infowars.com/macron-europe-faces-unprecedented-mass-migration-shares-destiny-with-africa/", "published": "2018-04-17T13:25:27-05:00"}, {"title": "Judge Kimba Wood Orders Trump’s Private Files To Be Distributed Across Federal Server", "text": "The U.S. District judge who ordered Trump’s lawyer Michael Cohen to identify Sean Hannity also ordered President Trump’s private files to be distributed, or ‘leaked’, across a federal server.", "link": "https://www.infowars.com/judge-kimba-wood-orders-trumps-private-files-to-be-distributed-across-federal-server/", "published": "2018-04-17T13:13:54-05:00"}]}, "foxnews": {"link": "http://www.foxnews.com/", "articles": [{"title": "McCabe's fate rests with Trump-appointed prosecutor", "text": "Fired FBI official Andrew McCabe’s fate rests in the hands of a Trump-appointed prosecutor, now that the Justice Department’s inspector general has sent a criminal referral over an investigative finding that he lied to James Comey and bureau investigators about a media disclosure.\n\nThat referral, sent by Inspector General Michael Horowitz, is now being considered by the U.S. attorney for the District of Columbia, Jessie Liu. President Trump appointed Liu in July 2017.\n\n“We were advised of the referral within the past few weeks,” McCabe’s counsel, Michael Bromwich, a former Justice Department inspector general, said in a statement. “Although we believe the referral is unjustified, the standard for an IG referral is very low. We have already met with staff members from the U.S. Attorney’s Office.”\n\nBromwich added, “We are confident that, unless there is inappropriate pressure from high levels of the administration, the U.S. Attorney’s Office will conclude that it should decline to prosecute.”\n\nDOJ WATCHDOG SENDS CRIMINAL REFERRAL FOR MCCABE TO FEDERAL PROSECUTOR\n\nMcCabe, the former FBI deputy director, is not alone in facing IG problems. It emerged Friday that even Comey is the subject of an IG review over his handling of classified information in memos he penned. But McCabe faces greater risk now that the findings of his case have been referred to the U.S. attorney.\n\nLiu is a Republican and has a long history of political donations to GOP candidates, according to Open Secrets political donation records, but it does not appear that she donated to Trump.\n\nLiu was criticized during her Senate confirmation hearing last year when it was revealed that she met with Trump at least once while being considered for the post — an unprecedented step in the process for potential U.S. attorney nominees.\n\nBut whether Liu will opt to prosecute McCabe is unclear. Referrals do not guarantee that charges will be brought, nor do they require prosecutors to act in any way.\n\nOfficials from the Justice Department, the inspector general’s office and the U.S. attorney’s office all declined to comment on the referral.\n\nAccording to Federal Code 18 USC 1001, someone prosecuted for making false statements could face a fine and/or up to five years imprisonment.\n\nFormer high-ranking Justice Department official James Trusty, who served under Presidents George W. Bush and Barack Obama, told Fox News that prosecution was unlikely.\n\n“It’s pretty unusual territory for a false-statement prosecution to be based on employment actions, like lying to your inspector general,” Trusty told Fox News. “It’s an unusual setting to have a false-statement prosecution because typically they’re associated with independent criminal probes. This is an employment probe.”\n\nOn the other hand, former U.S. Attorney Joseph diGenova, who last month was invited to join President Trump’s outside legal team but withdrew himself after a conflict of interest, said he thinks a prosecution is inevitable.\n\n“This is a senior FBI official. He lied under oath to FBI and Justice Department officials at least three times,” diGenova told Fox News Friday.\n\nThe IG sent the referral Thursday after he found that McCabe leaked a self-serving story to the press and later lied about it to then-FBI Director Comey and federal investigators, prompting Attorney General Jeff Sessions to fire him just days before his pension was set to become effective.\n\nThe initial investigation into McCabe was ordered by Comey. While the former FBI chief may not have intentionally been after his deputy, he was looking for the source of a leak to The Wall Street Journal in an Oct. 30, 2016, story confirming a bureau investigation into the Clinton Foundation.\n\nHorowitz found that McCabe lacked “candor” when questioned by FBI agents on multiple occasions, and that he wrongly told agents he did not authorize the disclosure and did not know who was responsible.\n\nMCCABE 'UPSET AND DISAPPOINTED' OVER COMEY COMMENTS\n\nBromwich blasted the Horowitz report, and said that it failed to “adequately address the evidence.” He suggested that the inspector general's office should “credit Mr. McCabe’s account over Director Comey’s.”\n\nComey has maintained McCabe did not tell him about the leak.\n\nTrusty, weighing the odds of prosecution, said that making false statements in the context of an “administrative interview” is “less sexy to prosecutors than a false statement during a criminal investigation.”\n\n“But that said, it’s a crap shoot,” Trusty said.\n\n\"They are prosecuting Michael Flynn for doing the same thing,\" diGenova noted.\n\nHowever, Mueller’s team, which is probing Russian meddling in the 2016 presidential election, is prosecuting former national security adviser Flynn after he pleaded guilty to making false statements to the FBI as part of a criminal investigation — not an inspector general investigation.\n\n“It is Liu’s job to take this up, and it’s got nothing to do with Trump,” diGenova said. “The Justice Department and the inspector general sent it to her, not because she’s a Trump appointee, but because she is the U.S. attorney.”\n\nHe added, “I think he will be prosecuted.”", "link": "http://www.foxnews.com/politics/2018/04/20/mccabes-fate-rests-with-trump-appointed-prosecutor.html", "published": "2018-04-20T00:00:00"}, {"title": "Anthony Bourdain slams Alec Baldwin's take on #MeToo movement: 'Just shut up'", "text": "Anthony Bourdain opened up about the #MeToo movement and shared some advice for actor and comedian, Alec Baldwin.\n\n“Just shut up,\" Bourdain advised the Hollywood actor when asked by the Daily Beast about their 2017 Twitter spat over Bourdain's girlfriend and Harvey Weinstein accuser Asia Argento.\n\n“When someone you care about and respect, you see them struggle to go on the record—the incredible difficulty of going public about something, and the very real peril at the time—it changes you,” Bourdain said of Argento accusing Weinstein of sexual assault. \"When Asia spoke to Ronan [Farrow], I think she might have been the first to go on record knowing with absolute certainty that she would most likely be sued, destroyed, crushed by this gigantic machine that had for decades been crushing far more powerful people than her who dared speak up. But she did it anyway. So to see that, and to see the blowback in Italy where she’s received no support, has been eye-opening.\"\n\nJust as the Weinstein scandal was starting to dominate headlines late last year, Argento called out Baldwin after he appeared on PBS Newshour and criticized Weinstein victim Rose McGowan, for setting with the disgraced movie mogul.\n\nArgento took to Twitter and said, \"Hey @AlecBaldwin you're either a complete moron or providing cover for your pals and saving your own rep. Maybe all three.\"\n\nBaldwin replied to Argento and wrote, \"If you paint every man w the same brush, you’re gonna run out of paint or men.\"\n\nAnd it wasn't long before Bourdain stepped in to defend his girlfriend. The TV host lashed back at Baldwin and said, \"You are really too dumb to pour piss out of a boot.\"\n\nFollowing the Twitter beef, Bourdain cooked dinner for three of Weinstein’s accusers: Argento, McGowan and Annabella Sciorra.\n\n“As importantly,” Bourdain continues, “the other women that started talking to Asia—sometimes in my presence—I started hearing a lot of things and seeing a lot of things that I had been blind to before, and had not heard before.\n\n\"I would love to tell you that I had all along been enlightened, but I was not. It was personal, it was emotional, and it was life-changing. I can only say that I’m honored and grateful to learn and be inspired by these women,\" he said.\n\nWhile Bourdain supports the #MeToo movement, the TV host admitted that he has been reluctant to speak out about the force changing the entertainment industry, explaining that unlike Baldwin, he doesn't want to steal the spotlight away from the many women who the movement is about.\n\n“It’s something I’m very aware of when I hear myself talking about it—it makes me very uneasy,” he said. “These are not my stories, so I feel that every time I’m talking about it I’m taking up space that should be rightfully taken by a woman. It’s a fine line for me. I don’t particularly enjoy talking about it. But if you ask me, I’ll tell ya.”", "link": "http://www.foxnews.com/entertainment/2018/04/20/anthony-bourdain-slams-alec-baldwins-take-on-metoo-movement-just-shut-up.html", "published": "2018-04-20T00:00:00"}, {"title": "Swedish house DJ Avicii dead at 28", "text": "Swedish EDM star Avicii was found dead in Muscat, Oman on Friday, a rep for the star told Fox News. He was 28.\n\n\"The family is devastated and we ask everyone to please respect their need for privacy in this difficult time,\" Avicii's publicist Diana Baron said. \"No further statements will be given.\"\n\nAvicii was a pioneer of the contemporary Electronic Dance Movement and a rare DJ capable of worldwide arena tour. He won two MTV Music Awards, one Billboard Music Award and earned two Grammy nominations. His biggest hit was \"Le7els.\"\n\nHis death comes just days after he was nominated for a Billboard Music Award for top dance/electronic album for his EP \"Avicii (01).\" He was nominated alongside his peers, who have taken EDM mainstream of late — The Chainsmokers, Calvin Harris and Kygo.\n\nHis hits include \"Wake Me Up!\" ''Levels\" and \"You Make Me.\"\n\nHe was part of the wave of DJ-producers, like David Guetta, Calvin Harris and Swedish House Mafia, who broke out on the scene as lead performers in their own right, earning international hits, fame, awards and more like typical pop stars.\n\nAvicii even collaborated with high-profile acts, producing Madonna's \"Devil Pray\" and the Coldplay hits \"A Sky Full of Stars\" and \"Hymn for the Weekend.\"\n\nAvicii suffered acute pancreatitis in the past, in part due to excessive drinking. After having his gallbladder and appendix removed in 2014, he canceled a series of shows in attempt to recover. He quit touring in 2016 but continued making music in the studio.\n\n\"It's been a very crazy journey. I started producing when I was 16. I started touring when I was 18. From that point on, I just jumped into 100 percent,\" Avicii told Billboard magazine in 2016.\n\n\"When I look back on my life, I think: whoa, did I do that? It was the best time of my life in a sense. It came with a price - a lot of stress a lot of anxiety for me - but it was the best journey of my life.\"\n\nLast year, he posted this message on his website, promising to keep creating: \"The next stage will be all about my love of making music to you guys. It is the beginning of something new.\"\n\nFox News' Ashley Dvorkin and the Associated Press contributed to this report.", "link": "http://www.foxnews.com/entertainment/2018/04/20/swedish-house-dj-avicii-dead-at-28.html", "published": "2018-04-20T00:00:00"}]}, "nbcnews": {"link": "http://www.nbcnews.com/", "articles": []}, "washingtonpost": {"rss": "http://feeds.washingtonpost.com/rss/world", "link": "https://www.washingtonpost.com/", "articles": []}}}